# 다음과 같이 코드 실행 결과가 나오도록 코드의 빈칸을 완성하세요.
#
# 실행 결과
# ['메이킷', '우진', '시은']
# 메이킷
# 우진
# 시은
# 코드
# a = ['메이킷','우진','시은']
# print(________)
# print(________)
# print(________)
# print(________)
# 핵심 잡기
# 파이썬에서는 여러 개의 정보를 변수 하나에 묶어서 저장하기 위해 리스트(list)와 튜플(tuple)이라는 자료형을 사용합니다. 리스트는 여는 대괄호( [ )와 닫는 대괄호( ] ) 사이에 콤마(,)를 기준으로 자료를 순서대로 저장합니다.
# 리스트에 저장된 각 정보를 사용하는 방법은 문자열에서 사용한 인덱스 접근 방식과 비슷합니다. 예를 들어, mylist = [1, 2, 3]에서 mylist는 리스트 변수이고, 차례대로 숫자 1, 2, 3을 저장합니다. 첫 번째로 저장된 숫자 1에 접근하려면 mylist[0]과 같이 인덱스 0번부터 사용합니다.
# 리스트 a에서 a[-1]은 리스트의 마지막 정보를 의미합니다.
# 문자열처럼 리스트에서도 a[1:2] 형식을 사용할 수 있습니다.
#
# 예
# 결과
# ['메이킷', '우진', '시은']
# 메이킷
# 우진
# 시은

a = ['메이킷', '우진', '시은']
print(a)
print(a[0])
print(a[1])
print(a[2])
